using System;
using System.Collections.Generic;
using System.Linq;
using bisSport.Domain.Core;
using bisSport.Server.Helpers;
using bisSport.Server.Repository;
using Microsoft.VisualStudio.TestTools.UnitTesting;

namespace bisSport.Tests.CRUD
{
  [TestClass]
  public class PlayerTests : TestBase
  {
    [TestMethod]
    public void PlayerCreate()
    {
      var player = CreatePlayer(Repository);
      player.Save();

      var playerFromDb = Repository.Players.GetAll().FirstOrDefault(x => x.Id == player.Id);

      Assert.AreEqual(player, playerFromDb);
    }

    [TestMethod]
    public void PlayerDelete()
    {
      var player = CreatePlayer(Repository);
      var playerId = player.Id;

      var playerFromDb = Repository.Players.GetAll().FirstOrDefault(x => x.Id == playerId);

      Assert.AreEqual(player, playerFromDb);

      playerFromDb.Delete();

      playerFromDb = Repository.Players.GetAll().FirstOrDefault(x => x.Id == playerId);

      Assert.IsNull(playerFromDb);
    }

    public static Player CreatePlayer(UnitOfWork repository)
    {
      var random = new Random();

      var player = repository.Players.Create();
      player.Name = $"Участник {random.Next(1, 99)}";

      player.Save();

      return player;
    }

    public static Player CreatePlayer(UnitOfWork repository, Random random)
    {
      var player = repository.Players.Create();
      player.Name = GetPlayerNameFromPool(random);

      player.Save();

      return player;
    }

    public static string GetPlayerNameFromPool(Random random)
    {
      return PlayerNames[random.Next(PlayerNames.Count)];
    }

    #region ФИО игроков 

    public static List<string> PlayerNames = new List<string>()
    {
     "Титов Ефим","Журавлёв Евгений","Третьяков Лукий","Родионов Константин","Евсеев Куприян","Гущин Лаврентий",
     "Денисов Варлам","Журавлёв Эдуард","Исаев Гордей","Фомичёв Герман","Трофимов Ефим","Калашников Пантелеймон",
     "Емельянов Бронислав","Петухов Максим","Терентьев Денис","Афанасьев Глеб","Шубин Онисим","Фомин Якун",
     "Нестеров Лукьян","Семёнов Ким","Данилов Авдей","Бобылёв Михаил","Кузьмин Богдан","Терентьев Евсей",
     "Иванов Вадим","Самойлов Лукий","Марков Владлен","Соколов Мстислав","Прохоров Георгий","Пахомов Даниил",
     "Фёдоров Матвей","Туров Ириней","Орехов Ким","Суворов Виталий","Стрелков Владимир","Никонов Арсений",
     "Киселёв Егор","Ильин Ефим","Ковалёв Артём","Зиновьев Степан","Рожков Юлиан","Беляев Христофор",
     "Пестов Константин","Кузьмин Авдей","Михеев Яков","Фролов Святослав","Жданов Фрол","Королёв Александр",
     "Архипов Борис","Ильин Фрол","Лазарев Серапион","Буров Фрол","Борисов Федосей","Туров Федосей",
     "Голубев Демьян","Горбунов Митрофан","Блохин Валерий","Селиверстов Дамир","Панов Фёдор","Ковалёв Павел",
     "Юдин Валерий","Гусев Аристарх","Хохлов Вячеслав","Беляков Всеволод","Шилов Глеб","Наумов Святослав",
     "Громов Протасий","Тарасов Онисим","Бобылёв Бронислав","Гордеев Геласий","Комиссаров Яков","Панфилов Антон",
     "Герасимов Михаил","Дементьев Валентин","Цветков Роман","Андреев Георгий","Ларионов Никита","Абрамов Святослав",
     "Лапин Никита","Гурьев Куприян","Никонов Георгий","Степанов Тихон","Костин Александр","Карпов Святослав",
     "Архипов Авксентий","Колобов Артём","Поляков Станислав","Егоров Геласий","Семёнов Якун","Васильев Олег",
     "Громов Константин","Лапин Олег","Голубев Георгий","Куликов Пантелеймон","Быков Валерьян","Копылов Богдан",
     "Тетерин Дамир","Виноградов Мстислав","Попов Пантелеймон","Муравьёв Руслан","Буров Богдан","Чернов Серапион",
     "Селиверстов Федот","Воронов Александр","Евсеев Ефим","Борисов Павел","Терентьев Юрий","Андреев Авксентий",
     "Дьячков Александр","Жданов Пантелеймон","Матвиенко Михаил","Сергеев Богдан","Артемьев Аристарх",
     "Константинов Лукьян","Калашников Даниил","Пахомов Леонид","Русаков Вячеслав","Наумов Дмитрий","Князев Владислав",
     "Стрелков Станислав","Вишняков Созон","Никонов Станислав","Крюков Лаврентий","Горшков Дамир",
     "Александров Авксентий","Зимин Онисим","Семёнов Михаил","Маслов Валерьян","Гуляев Андрей","Жуков Агафон",
     "Горбунов Станислав","Петухов Мэлор","Ширяев Дамир","Михеев Федосей","Тимофеев Василий","Копылов Христофор",
     "Филиппов Иван","Зуев Даниил","Кузнецов Вадим","Беспалов Дмитрий","Савин Улеб","Кудрявцев Богдан",
     "Некрасов Игорь","Потапов Авксентий","Тетерин Герман","Мельников Тихон","Жданов Бронислав","Исаков Матвей",
     "Чернов Митрофан","Игнатов Ким","Блохин Аристарх","Зайцев Владимир","Сазонов Серапион","Волков Глеб",
     "Баранов Вячеслав","Емельянов Мэлс","Носов Виктор","Воробьёв Михаил","Устинов Богдан","Рогов Улеб",
     "Виноградов Созон","Веселов Федот","Владимиров Парфений","Харитонов Святослав","Юдин Юлиан","Медведьев Евгений",
     "Никитин Варлам","Горбачёв Геласий","Ларионов Антонин","Исаков Созон","Ларионов Фрол","Михайлов Варлам",
     "Мамонтов Яков","Анисимов Мартын","Пономарёв Владлен","Власов Владлен","Веселов Игнатий","Мартынов Антонин",
     "Миронов Святослав","Ефимов Валерьян","Федотов Филат","Попов Сергей","Ларионов Роман","Комаров Альвиан",
     "Ширяев Владимир","Лукин Мэлор","Пономарёв Иван","Фёдоров Ефим","Никифоров Серапион","Нестеров Бронислав",
     "Гордеев Евсей","Медведьев Еремей","Казаков Богдан","Зимин Владислав","Агафонов Максим","Пестов Артём",
     "Некрасов Герман","Калашников Донат","Самойлов Пётр","Лихачёв Денис","Пономарёв Всеволод","Блинов Владлен",
     "Сафонов Матвей","Логинов Георгий","Харитонов Павел","Новиков Ярослав","Воробьёв Ириней","Гусев Борис",
     "Федосеев Александр","Голубев Яков","Носков Артём","Пахомов Кондрат","Жуков Аркадий","Фокин Онисим",
     "Селиверстов Даниил","Кириллов Донат","Исаков Илья","Игнатьев Михаил","Лазарев Герман","Савин Денис",
     "Маслов Альберт","Лобанов Протасий","Блохин Сергей","Новиков Юрий","Суворов Фрол","Сысоев Ириней",
     "Громов Эдуард","Казаков Илья","Лобанов Олег","Мишин Вячеслав","Меркушев Николай","Шестаков Виктор",
     "Бобров Валентин","Денисов Василий","Герасимов Николай","Аксёнов Мартын","Белов Сергей","Веселов Глеб",
     "Медведев Федот","Третьяков Мстислав","Ковалёв Митрофан","Шашков Сергей","Родионов Владлен","Лыткин Митрофан",
     "Чернов Станислав","Блохин Виталий","Колобов Глеб","Беспалов Мэлор","Миронов Федосей","Галкин Георгий",
     "Попов Егор","Крылов Германн","Владимиров Ростислав","Котов Протасий","Блинов Владимир","Павлов Варлам",
     "Блинов Борис","Молчанов Алексей","Кудряшов Дамир","Павлов Фрол","Денисов Юлиан","Большаков Валентин",
     "Петухов Эдуард","Дроздов Глеб","Копылов Пётр","Никифоров Серапион","Мельников Валерий","Авдеев Эдуард",
     "Пестов Григорий","Кузьмин Донат","Карпов Семён","Федотов Аркадий","Селезнёв Донат","Хохлов Авдей",
     "Давыдов Ким","Мухин Степан","Авдеев Варлам","Казаков Алексей","Фокин Авдей","Селиверстов Авксентий",
     "Белозёров Денис","Шаров Никита","Белозёров Валерий","Колобов Протасий","Фомин Аркадий","Жданов Максим",
     "Ермаков Донат","Константинов Святослав","Сергеев Пётр","Дроздов Олег","Елисеев Макар","Рыбаков Даниил",
     "Рыбаков Вячеслав","Лихачёв Виктор","Карпов Максим","Котов Бронислав","Большаков Пётр","Суворов Лаврентий",
     "Муравьёв Лаврентий","Фомичёв Артём"
    };

    #endregion
  }
}
